-- 学生表插入数据
INSERT INTO `t_student` (`Sid`, `Sname`, `Sage`)
VALUES ('s01', '唐嫣', 18),
('s02', '胡歌', 17),
('s03', '刘滋滋', 18),
('s04', '杨咪', 17),
('s05', '何建华', 19),
('s06', '彭玉燕', 18);

-- 教师表插入数据
INSERT INTO `t_teacher` (`Tid`, `Tname`)
VALUES ('101', '高磊'),
('102', '韩正'),
('103', '李正辉'),
('104', '何倩纹'),
('105', '刘红'),
('106', '彭伟');

-- 课程表插入数据
INSERT INTO `t_course` (`Cid`, `Cname`, `Cteacher`)
VALUES ('c01', '高等数学', '高磊'),
('c02', '英语', '韩正'),
('c03', '计算机基础', '李正辉'),
('c04', '汇编语言', '何倩纹'),
('c05', '电子商务', '李正辉');

-- 成绩表插入数据
INSERT INTO `t_source` (`Sid`, `Cid`, `Csource`)
VALUES ('s01', 'c01', 58),
('s01', 'c02', 59),
('s01', 'c03', 55),
('s02', 'c02', 83),
('s02', 'c05', 79),
('s02', 'c04', 77),
('s03', 'c01', 55),
('s03', 'c03', 81),
('s03', 'c04', 73),
('s04', 'c01', 67),
('s04', 'c02', 78),
('s04', 'c03', 82),
('s04', 'c05', 80),
('s05', 'c01', 61),
('s05', 'c04', 78);